void insertionSort(int arr[], int n) {
    for (int i = 1; i < n; i++) {
        int key = arr[i];      // Элемент, который вставляем
        int j = i - 1;

        // Сдвигаем элементы больше key вправо
        while (j >= 0 && arr[j] > key) {
            arr[j + 1] = arr[j];
            j--;
        }

        // Вставляем key на правильное место
        arr[j + 1] = key;
    }
}

// [5, 2, 4, 6, 1]

// [5 | 2, 4, 6, 1]
// [2, 5 | 4, 6, 1]
// [2, 4, 5 | 6, 1]
// [2, 4, 5, 6 | 1]
// [1, 2, 4, 5, 6]

// О(n)

void bubbleSort(int arr[], int n) {
    for (int i = 0; i < n - 1; i++) {          // Количество проходов
        for (int j = 0; j < n - i - 1; j++) {  // Сравнение соседей
            if (arr[j] > arr[j + 1]) {
                std::swap(arr[j], arr[j + 1]);
            }
        }
    }
}

// [5, 1, 4, 2, 8]

// [1, 5, 4, 2, 8]
// [1, 4, 5, 2, 8]
// [1, 4, 2, 5, 8]
// [1, 2, 4, 5, 8]

// О(n^2)

void selectionSort(int arr[], int n) {
    for (int i = 0; i < n - 1; i++) {
        int minIndex = i;

        // Поиск минимального элемента
        for (int j = i + 1; j < n; j++) {
            if (arr[j] < arr[minIndex]) {
                minIndex = j;
            }
        }

        // Обмен местами
        std::swap(arr[i], arr[minIndex]);
    }
}
// [64, 25, 12, 22, 11]

// [11, 25, 12, 22, 64]
// [11, 12, 25, 22, 64]
// [11, 12, 22, 25, 64]

// О(n^2)

// | Алгоритм  | Сложность | Память | Стабильность |
// | --------- | --------- | ------ | ------------ |
// | Вставками | O(n²)     | O(1)   |  Да         |
// | Пузырьком | O(n²)     | O(1)   |  Да         |
// | Выбором   | O(n²)     | O(1)   |  Нет        |

